app/controllers/attendees_controller.rb

  def index
    @attendees = Attendee.all
---
SELECT `attendees`.* FROM `attendees`