app/controllers/basics_controller.rb

  def index
    @basics = Basic.all
---
SELECT `basics`.* FROM `basics`