app/controllers/custom_questions_controller.rb

SELECT `custom_questions`.* FROM `custom_questions`
---
  def index
    @custom_questions = CustomQuestion.all

SELECT `custom_questions`.* FROM `custom_questions` WHERE (`custom_questions`.`id` = 1) LIMIT 1
---
  def show
    @custom_question = CustomQuestion.find(params[:id])

SELECT `custom_questions`.* FROM `custom_questions` WHERE (`custom_questions`.`id` = 1) LIMIT 1
---
  def edit
    @custom_question = CustomQuestion.find(params[:id])

INSERT INTO `custom_questions` (`created_at`, `permission_level`, `question`, `question_type_id`, `sort_order`, `updated_at`) VALUES ('2010-10-30 17:22:35', '', '', NULL, NULL, '2010-10-30 17:22:35')
---
  def create
    @custom_question = CustomQuestion.new(params[:custom_question])

    respond_to do |format|
      if @custom_question.save

SELECT `custom_questions`.* FROM `custom_questions` WHERE (`custom_questions`.`id` = 1) LIMIT 1
---
  def update
    @custom_question = CustomQuestion.find(params[:id])