app/controllers/invites_controller.rb

SELECT `invites`.* FROM `invites`
---
  def index
    @invites = Invite.all

SELECT `invites`.* FROM `invites` WHERE (`invites`.`id` = 980190962) LIMIT 1
---
  def show
    @invite = Invite.find(params[:id])

SELECT `invites`.* FROM `invites` WHERE (`invites`.`id` = 980190962) LIMIT 1
---
  def edit
    @invite = Invite.find(params[:id])

INSERT INTO `invites` (`code`, `created_at`, `date`, `email`, `name`, `updated_at`) VALUES ('MyString', '2010-10-28 22:06:20', '2010-10-28 19:38:26', 'MyString', 'MyText', '2010-10-28 22:06:20')
---
  def create
    @invite = Invite.new(params[:invite])

    respond_to do |format|
      if @invite.save

SELECT `invites`.* FROM `invites` WHERE (`invites`.`id` = 980190962) LIMIT 1
---
  def update
    @invite = Invite.find(params[:id])

SELECT `invites`.* FROM `invites` WHERE (`invites`.`id` = 980190962) LIMIT 1
DELETE FROM `invites` WHERE (`invites`.`id` = 980190962)
---
  def destroy
    @invite = Invite.find(params[:id])
    @invite.destroy